docs/research/2026-03-07_NARROWING_AND_SEARCH_HEURISTICS.org
#+TITLE: Narrowing, Constraint Propagation, and Search Heuristics: Toward a Unified Solver Architecture
#+AUTHOR: Prologos Research
#+DATE: 2026-03-07
#+OPTIONS: toc:3 num:t

* Abstract

This document surveys three converging lines of work and explores how they
unify on Prologos's propagator substrate:

1. *Narrowing* in the functional-logic programming sense (Antoy, Hanus,
   Curry): unification-driven evaluation of functions, enabling functions to
   be used as relations.
2. *Constraint propagation and domain narrowing* in the CLP/CSP sense (arc
   consistency, bound consistency, global constraints): lattice-based
   reduction of variable domains to a fixpoint.
3. *Configurable search heuristics* in the constraint programming sense
   (ECLiPSe, Gecode, MiniZinc): variable ordering, value selection, and
   search strategy as orthogonal, user-configurable axes.

The central thesis: Prologos's propagator network + ATMS + lattice cells
already provide the computational substrate for all three. What is needed is
the /connective tissue/---the abstractions that wire narrowing steps, domain
reductions, and search decisions into the existing infrastructure.

* 1. Narrowing: Two Senses, One Convergence

** 1.1 Functional-Logic Narrowing

Narrowing in the functional-logic (FL) programming tradition is the
mechanism that unifies functional evaluation (rewriting) with logic
programming (resolution/unification).

*** Definition

Given a term rewriting system $R$ and a term $s$, a *narrowing step* consists of:

1. Select a non-variable subterm $s|_p$ of $s$ at position $p$.
2. Find a rule $l \to r$ in $R$ (renamed to share no variables with $s$).
3. Compute the most general unifier $\sigma = mgu(s|_p, l)$.
4. The result is $s\sigma[r\sigma]_p$---the term $s\sigma$ with the subterm
   at position $p$ replaced by $r\sigma$.

The key distinction from rewriting: rewriting requires $s|_p$ to /match/ $l$
(the subterm must already be an instance of the left-hand side). Narrowing
allows $s|_p$ to /unify/ with $l$, which may /instantiate variables/ in $s$
as a side effect.

*** Example

Consider the function:

#+begin_src prologos
defn add [x y]
  | [Zero y]    := y
  | [(Suc n) y] := [Suc [add n y]]
#+end_src

*Rewriting* can evaluate ~[add [Suc Zero] [Suc Zero]]~ by matching the
second clause and reducing step by step to ~[Suc [Suc Zero]]~.

*Narrowing* can solve ~[add ?X ?Y] = [Suc [Suc Zero]]~ by:
- Trying to unify ~[add ?X ?Y]~ with the first clause head ~[add Zero ?y]~.
  This gives $\sigma_1 = \{X \mapsto Zero, Y \mapsto Suc(Suc(Zero))\}$.
  Checking: ~add Zero [Suc [Suc Zero]]~ reduces to ~[Suc [Suc Zero]]~. Solution found.
- Trying the second clause head ~[add [Suc ?n] ?y]~.
  This gives $\sigma_2 = \{X \mapsto Suc(?n)\}$ and a residual goal
  ~[Suc [add ?n ?y]] = [Suc [Suc Zero]]~, which narrows to
  ~[add ?n ?y] = [Suc Zero]~. Recursion continues, yielding
  $\{X \mapsto Suc(Zero), Y \mapsto Suc(Zero)\}$ and
  $\{X \mapsto Suc(Suc(Zero)), Y \mapsto Zero\}$.

The function ~add~ has been /inverted/---used as a relation---without any
additional definitions.

*** The Narrowing Lemma

If $s\sigma \to^*_R t$ (an instance of $s$ rewrites to $t$ in zero or more
steps), then there exist terms $s'$ and $t'$ such that $s \leadsto^*_R s'$
(narrowing), $t \to^*_R t'$ (rewriting), and $t'$ is an instance of $s'$.

This ensures narrowing is /complete/ for finding solutions to equational
goals: any solution discoverable by rewriting is also discoverable by
narrowing.

** 1.2 Needed Narrowing

Basic narrowing is complete but wildly inefficient---it tries all possible
subterm positions and all possible rules at each step, leading to a
combinatorial explosion. /Needed narrowing/ (Antoy, Echahed, Hanus 1994/2000)
restricts this to only the steps that are /demanded/ by the computation.

*** Definitional Trees

The key data structure is the *definitional tree*, which encodes the
case-analysis structure of a function definition. A definitional tree for a
function $f$ of arity $n$ is a finite tree where:

- *Rule nodes* are leaves containing a rewrite rule $l \to r$.
- *Branch nodes* contain a /pattern variable/ (the inductive position) and
  a set of children, one per constructor of that variable's type.
- (Optionally) *Exempt nodes* mark positions where no rule applies.

For the ~add~ function above, the definitional tree is:

#+begin_example
branch on arg 1:
  |
  +-- Zero    --> rule: add Zero y = y
  |
  +-- Suc n   --> rule: add (Suc n) y = Suc (add n y)
#+end_example

This tree says: "to evaluate ~add X Y~, first inspect the outermost
constructor of argument 1. If it's ~Zero~, apply rule 1. If it's ~Suc~,
apply rule 2."

*** Inductively Sequential Functions

A function is *inductively sequential* if its defining rules can be organized
into a definitional tree (i.e., the case analysis is uniform and
non-overlapping). Most naturally-written functions are inductively sequential.
All functions definable by nested pattern matching (without overlapping
clauses or guards) are inductively sequential.

*** The Needed Narrowing Strategy

Given a definitional tree and a goal ~f(t1, ..., tn)~:

1. Traverse the tree from root.
2. At a branch node on position $p$: examine the subterm at position $p$.
   - If it's a constructor: follow the matching child branch.
   - If it's a variable: /narrow/ by trying all constructors of that type
     (creating choice points), then continue down each branch.
   - If it's a function application: /demand/ its evaluation first
     (recursive narrowing).
3. At a rule node: apply the rule (rewrite).

*** Optimality Results

For inductively sequential functions, needed narrowing achieves:

1. *Minimal derivation length*: no derivation computes a shorter successful
   sequence.
2. *Independent solutions*: computed answers are pairwise incomparable (no
   redundant, more-general solutions).
3. *Subsumption*: needed narrowing subsumes both lazy functional evaluation
   (when all arguments are ground) and SLD resolution (when functions are
   just constructors).

These results are proven in Antoy, Echahed, Hanus, "A Needed Narrowing
Strategy," /JACM/ 47(4):776--822, 2000.

