docs/research/2026-03-07_NARROWING_AND_SEARCH_HEURISTICS.md


<a id="orga7ce436"></a>

## 1.3 Non-Deterministic Functions and Overlapping Rules

When function definitions have *overlapping* rules (the same input matches multiple clauses), the function is *non-deterministic*. For example:

```prologos
defn insert [x xs]
  | [x xs]       := [Cons x xs]
  | [x [Cons y ys]] := [Cons y [insert x ys]]
```

Both clauses apply when `xs` is a `Cons`. In Curry, this is handled by trying both alternatives non-deterministically (creating a choice point). The definitional tree for overlapping rules requires a generalization: the tree may have *or-nodes* where multiple branches are explored.

This is directly analogous to the `defr` semantics in Prologos, where multiple clauses create alternative derivations. Non-deterministic functions via overlapping rules are the bridge between `defn` and `defr`.


<a id="org36ad397"></a>

## 1.4 Constraint Propagation Narrowing

In constraint logic programming (CLP), "narrowing" refers to the reduction of variable domains through constraint propagation. This is a distinct but structurally analogous concept:


<a id="org31eabe1"></a>

### Arc Consistency (AC-3)

Given a constraint $C(X, Y)$ and domains $D_X$, $D_Y$:

-   For each value $x \in D_X$, check if there exists $y \in D_Y$ such that $C(x, y)$ holds.
-   Remove $x$ from $D_X$ if no such $y$ exists.
-   Repeat until no domain changes (fixpoint).

This is *domain narrowing*&#x2014;the domain shrinks monotonically until a fixpoint is reached.


<a id="org54d1362"></a>

### The Structural Parallel

| FL Narrowing                    | Constraint Narrowing                  |
|------------------------------- |------------------------------------- |
| Unify goal with rule LHS        | Constraint removes values from domain |
| Definitional tree guides choice | Arc consistency guides propagation    |
| Non-determinism $\to$ backtrack | Domain splitting $\to$ search         |
| Needed narrowing = optimal      | AC-3/BC = sound & complete            |
| `defn` clause = rewrite rule    | Constraint = propagator               |
| Variable instantiation          | Domain reduction                      |


<a id="org545a610"></a>

### Convergence on the Propagator Substrate

Both FL narrowing and constraint narrowing are instances of the same abstract operation: *monotone refinement of information about variables*. In Prologos:

-   A propagator cell holds a lattice value representing knowledge about a variable.
-   FL narrowing writes a more-specific value ("this variable has constructor `Suc`") to a cell.
-   Constraint narrowing writes a reduced domain ("[1,6] instead of [1,10]") to a cell.
-   `run-to-quiescence` propagates both kinds of refinement to a fixpoint.
-   When propagation alone can't determine a unique value, search (ATMS `amb`) introduces choice points&#x2014;analogous to both backtracking in FL narrowing and domain splitting in constraint solving.


<a id="org50657a4"></a>

# 2. Search Heuristics: The Third Axis

The previous section established that narrowing (both FL and constraint) maps naturally to propagator cell writes + quiescence. But when propagation reaches a fixpoint without fully determining all variables, *search* is needed. How search is conducted&#x2014;which variable to branch on, which value to try, how to traverse the search tree&#x2014;dramatically affects performance.


<a id="org6331368"></a>

## 2.1 ECLiPSe's search/6: A Design Template

ECLiPSe CLP's `search/6` predicate factors search into three orthogonal axes, providing a clean, composable interface:

```
search(+Vars, +Arg, +Select, +Choice, +Method, +Options)
```


<a id="orgcd5d2ca"></a>

### Variable Selection (Select)

Determines which variable to branch on next:

| Strategy                     | Description                                      |
|---------------------------- |------------------------------------------------ |
| `input_order`                | Declaration order (naive, deterministic)         |
| `first_fail`                 | Smallest domain first (most constrained)         |
| `anti_first_fail`            | Largest domain first                             |
| `most_constrained`           | Smallest domain, tiebreak by constraint count    |
| `most_constrained_per_value` | Ratio: constraint count / domain size            |
| `max_regret`                 | Largest gap between best and second-best value   |
| `max_weighted_degree`        | Learned from failures (adaptive, dom/wdeg)       |
| `max_activity`               | Most recently active in propagation (VSIDS-like) |
| `random`                     | Random selection (useful for restarts)           |

The *first-fail principle* ("to succeed, try first where you are most likely to fail") is the dominant heuristic. The intuition: if a variable has only 2 possible values, branching on it creates a binary tree. If another has 100, branching creates 100 children. Resolving the tight variable first prunes much more of the search space.

*Adaptive* heuristics like `max_weighted_degree` (dom/wdeg, Boussemart et al.

1.  learn from failures: each constraint has a weight incremented on domain

wipeout. Variables connected to high-weight constraints are preferred. This captures problem structure that static heuristics miss.


<a id="orga4b504a"></a>

### Value Selection (Choice)

Determines which value to try for the selected variable:

| Strategy                   | Description                                    |
|-------------------------- |---------------------------------------------- |
| `indomain_min`             | Try smallest value first                       |
| `indomain_max`             | Try largest value first                        |
| `indomain_median`          | Try median value                               |
| `indomain_split`           | Binary split: try $[lo, mid]$ then $(mid, hi]$ |
| `indomain_reverse_split`   | Reverse binary split                           |
| `indomain_random`          | Random value selection                         |
| `from_smaller(Pos, Hints)` | Try hinted values first (smallest bias)        |
| `from_larger(Pos, Hints)`  | Try hinted values first (largest bias)         |

The *succeed-first principle* applies here: choose values likely to appear in solutions. Binary splitting (`indomain_split`) is particularly effective for numeric domains because it reduces domains geometrically.


<a id="orgb81e3f8"></a>

### Search Strategy (Method)

Determines how the search tree is traversed:

| Strategy                    | Description                                                        |
|--------------------------- |------------------------------------------------------------------ |
| `complete`                  | Exhaustive depth-first search                                      |
| `lds(D)`                    | Limited discrepancy search (at most $D$ deviations from heuristic) |
| `bb_min(Cost)`              | Branch-and-bound minimization                                      |
| `restart(Cutoff)`           | Restart-based search (luby, geometric, random sequences)           |
| `restart_min(Cost, Cutoff)` | Optimization with restarts                                         |


<a id="org72f4ff8"></a>

### Options

Additional configuration:

| Option              | Description                            |
|------------------- |-------------------------------------- |
| `tiebreak(Select2)` | Secondary variable selection criterion |
| `timeout(Seconds)`  | Search time limit                      |
| `backtrack(N)`      | Returns number of backtracks           |
| `ldsb_syms(Syms)`   | Lightweight Dynamic Symmetry Breaking  |


<a id="org3897ee6"></a>

## 2.2 Gecode's Architecture: Propagate + Branch

Gecode cleanly separates propagation from search via *branchers*:

1.  **Propagation phase**: All propagators run to fixpoint (domain narrowing).
2.  **Branch phase**: A *brancher* examines the current state and makes a *decision* (e.g., $X \leq 5$ vs. $X > 5$). This is *not* a propagator&#x2014; it's a separate mechanism that introduces a binary choice.
3.  The solver creates two child nodes (one for each branch), and recursively applies propagation + branching.

The key insight: *propagation is deterministic and monotone*; *branching is non-deterministic and creates the search tree*. Keeping them separate allows independent optimization of each.

This maps directly to Prologos's architecture:

-   Propagation = `run-to-quiescence`
-   Branching = `atms-amb` (creates mutually exclusive assumptions)
