docs/research/2026-03-07_NARROWING_AND_SEARCH_HEURISTICS.org
** 2.3 MiniZinc: Declarative Search Annotations

MiniZinc provides declarative search annotations that separate the model from
the search strategy:

#+begin_src minizinc
solve :: int_search(x, first_fail, indomain_min, complete)
      minimize cost;
#+end_src

This annotates the solve statement with: use ~first_fail~ variable ordering,
~indomain_min~ value selection, ~complete~ (DFS) tree search, and minimize
~cost~ via branch-and-bound. The model is independent of the search---the
same model can be solved with different strategies.

* 3. Current Prologos Architecture

** 3.1 The Three Layers

Prologos's logic/constraint infrastructure has three layers:

1. *Propagator Network* (~propagator.rkt~): Pure, persistent, immutable.
   Cells hold lattice values with monotone merge functions.
   ~run-to-quiescence~ computes the least fixpoint.

2. *ATMS* (~atms.rkt~): Assumption-Based Truth Maintenance. ~atms-amb~
   creates choice points with mutually exclusive alternatives. ~atms-solve-all~
   enumerates consistent worldviews. Nogoods prune inconsistent combinations.

3. *Solver* (~relations.rkt~ + ~stratified-eval.rkt~): DFS-based relation
   solver. Unification, backtracking, tabling, stratified negation.

** 3.2 Current Search Strategy

The current solver uses:

| Component | Strategy | Configurable? |
|-|-|-|
| Clause ordering | Top-to-bottom (reader order) | No |
| Fact matching | Linear scan, try all matching | No |
| Backtracking | Exhaustive DFS via append-map | No |
| Depth control | Hard limit (100) | In code only |
| Fuel limit | 1,000,000 propagator firings | In code only |
| Negation | Negation-as-failure (stratified) | No |
| Tabling | SLG by default | Via ~solver~ config |
| Execution | Sequential or BSP parallel | Via ~solver~ config |

The ~solver~ top-level form provides some configuration:

#+begin_src prologos
solver default-solver
  :execution   'parallel
  :threshold   4
  :strategy    'auto
  :tabling     'by-default
  :provenance  'none
  :timeout     #f
#+end_src

But the three ECLiPSe axes (variable ordering, value selection, search
method) are entirely absent.

** 3.3 What Already Exists for Narrowing/Constraints

1. *Lattice cells*: ~net-new-cell~ takes arbitrary merge functions and
   contradiction predicates. Any lattice can be used.

2. *Widening/narrowing support*: ~net-set-widen-point~, ~net-cell-write-widen~,
   ~run-to-quiescence-widen~ implement the two-phase widening→narrowing
   fixpoint iteration from abstract interpretation.

3. *Cross-domain propagation*: ~net-add-cross-domain-propagator~ can bridge
   between different lattice domains (e.g., type domain ↔ multiplicity
   domain).

4. *ATMS amb*: ~atms-amb~ already creates choice points with mutual
   exclusion. This is the branching mechanism.

5. *Pattern matching infrastructure*: ~defn~ multi-clause syntax with ~|~
   arms provides the definitional tree structure implicitly.

6. *Unification*: ~relations.rkt~ has a Robinson unification algorithm
   (walk-based, substitution as hasheq).

* 4. Synthesis: A Unified Solver Architecture

** 4.1 The Vision

Unify FL narrowing, constraint propagation, and configurable search into a
single architecture where:

- *Functions are relations*: Any ~defn~ definition can be queried with
  unbound variables (via narrowing).
- *Constraints are propagators*: CLP(FD) constraints compile to propagators
  on domain cells.
- *Search is configurable*: Variable ordering, value selection, and search
  strategy are user-specifiable via ~solver~ configuration or search
  annotations.
- *Everything runs on the propagator network*: Narrowing steps, constraint
  propagation, and search branching all expressed as operations on the
  persistent propagator network + ATMS.

** 4.2 Architecture: Propagate → Branch → Propagate

The core loop, following Gecode's clean separation:

#+begin_example
solve(goals, strategy):
  1. Install constraints as propagators on domain cells
  2. Install narrowing propagators for function goals
  3. LOOP:
     a. run-to-quiescence (propagation phase)
     b. IF all variables determined: RETURN solution
     c. IF contradiction: BACKTRACK (or FAIL)
     d. SELECT variable to branch on (variable ordering heuristic)
     e. SELECT value/split for that variable (value ordering heuristic)
     f. CREATE choice point via atms-amb
     g. GOTO 3a
#+end_example

Each iteration of the loop alternates between deterministic propagation
(narrowing + constraint propagation running together to fixpoint) and
non-deterministic branching (search heuristic picks a variable and value).

** 4.3 Extended Solver Configuration

#+begin_src prologos
solver my-solver
  :variable-order  first-fail    ;; or most-constrained, max-activity, ...
  :value-order     bisect        ;; or min, max, random, ...
  :search          complete      ;; or (lds 3), (bb-min cost), (restart (luby 100)), ...
  :tabling         by-default
  :provenance      full
  :timeout         30
#+end_src

This extends the existing ~solver~ form with the three ECLiPSe axes. The
search strategy, in particular, replaces the hardcoded DFS in ~solve-goals~
with a pluggable control structure.

** 4.4 Where Heuristics Live in the Stack

| Heuristic | Layer | Mechanism |
|-|-|-|
| Variable ordering | ATMS | Which ~amb~ group to resolve first |
| Value ordering | ~amb~ call | Order of alternatives in ~atms-amb~ |
| Search strategy | Outer solve loop | Control structure for solution enumeration |
| Constraint propagation | Propagator network | Propagators on domain cells |
| FL narrowing | Propagator network | Narrowing propagators on term cells |

** 4.5 Domain Cells for CLP(FD)

Constraint domains require concrete lattice instantiations:

*** Finite Domain Cell

#+begin_src racket
;; Domain: set of integers
;; Merge: intersection (narrowing = removing impossible values)
;; Contradiction: empty set
(define (fd-merge d1 d2) (set-intersect d1 d2))
(define (fd-contradiction? d) (set-empty? d))
(define fd-cell (net-new-cell net (set 1 2 3 4 5 6 7 8 9) fd-merge fd-contradiction?))
#+end_src

*** Interval Cell

#+begin_src racket
;; Domain: [lo, hi] interval
;; Merge: intersection (tighten bounds)
;; Contradiction: lo > hi
(define (interval-merge i1 i2)
  (interval (max (interval-lo i1) (interval-lo i2))
            (min (interval-hi i1) (interval-hi i2))))
(define (interval-contradiction? i)
  (> (interval-lo i) (interval-hi i)))
#+end_src

*** Constraint Propagators

#+begin_src racket
;; X + Y = Z: propagator watching all three cells
;; On change to any: narrow the others
(define (add-constraint-propagator net x-cell y-cell z-cell)
  (net-add-propagator net
    (list x-cell y-cell z-cell)  ;; inputs
    (list x-cell y-cell z-cell)  ;; outputs (all may be narrowed)
    (lambda (net)
      (let ([x (net-cell-read net x-cell)]
            [y (net-cell-read net y-cell)]
            [z (net-cell-read net z-cell)])
        ;; Narrow x to [z.lo - y.hi, z.hi - y.lo]
        ;; Narrow y to [z.lo - x.hi, z.hi - x.lo]
        ;; Narrow z to [x.lo + y.lo, x.hi + y.hi]
        ...))))
#+end_src

