docs/research/2026-03-07_NARROWING_AND_SEARCH_HEURISTICS.md


<a id="org3f3a393"></a>

## 4.6 Narrowing Propagators for FL Functions

A narrowing propagator for a `defn` function:

1.  Watches the cells for the function's arguments.
2.  Reads the definitional tree.
3.  At a branch node: checks if the argument cell has a known constructor.
    -   If yes: follows the matching branch deterministically.
    -   If no: creates an `amb` over all constructors of the argument's type.
4.  At a rule node: applies the rewrite (writes to the result cell).

```racket
;; Narrowing propagator for add(X, Y) = Z
(define (narrowing-add net x-cell y-cell z-cell)
  ;; Definitional tree: branch on x
  (let ([x-val (net-cell-read net x-cell)])
    (cond
      [(eq? x-val 'bot)
       ;; x unknown: create amb over {Zero, Suc(?)}
       ;; (deferred to search phase — install demand marker)
       net]
      [(equal? x-val 'Zero)
       ;; Rule 1: add Zero y = y → unify z with y
       (net-cell-write net z-cell (net-cell-read net y-cell))]
      [(and (pair? x-val) (equal? (car x-val) 'Suc))
       ;; Rule 2: add (Suc n) y = Suc (add n y)
       ;; Create recursive narrowing for add(n, y) = z'
       ;; Then z = Suc z'
       ...])))
```


<a id="org335aac8"></a>

# 5. Advanced Topics


<a id="org495be55"></a>

## 5.1 Residuation vs. Narrowing

Curry supports two evaluation strategies for functions with unbound arguments:

-   **Narrowing**: Non-deterministically instantiate the variable and continue. Sound and complete, but may create many choice points.
-   **Residuation**: *Suspend* evaluation until the variable is bound by another part of the computation. Deterministic but may deadlock if the variable is never bound.

Prologos's propagator network naturally supports *residuation*: a propagator whose input cell is `bot` simply doesn't fire. When another propagator writes to that cell, the first propagator fires. This is demand-driven evaluation via the propagator dependency graph.

The combination of residuation (wait for information) and narrowing (guess when waiting would deadlock) is the operational strategy used by Curry's PAKCS system. In Prologos, this could be:

1.  During propagation: residuate (don't narrow; wait for information).
2.  At the branching phase (after quiescence): if unresolved demands remain, narrow by creating `amb` choices.


<a id="org10018b8"></a>

## 5.2 Encapsulated Search

Curry's `allValues` and `oneValue` provide encapsulated search: the non-determinism of narrowing is captured as a data structure rather than leaking into the caller. This is analogous to Prologos's `solve` form, which returns a sequence of all solutions.

The interaction between encapsulated search and constraint solving is subtle: constraints inside an encapsulated search should be local to that search scope. Prologos's persistent propagator network handles this naturally: each search branch gets an immutable snapshot of the network, and local modifications don't affect other branches.


<a id="org719468b"></a>

## 5.3 CFLP(FD): Constraint Functional Logic Programming

The CFLP framework (Fernandez, Hortala-Gonzalez, et al.) unifies all three paradigms: functional evaluation, logic programming, and finite domain constraints. The key innovation is the *Constraint Lazy Narrowing Calculus* (CLNC), which extends needed narrowing with constraint propagation:

-   Narrowing steps may generate constraints (e.g., narrowing `X + Y = 7` generates the constraint $X + Y = 7$ rather than enumerating all pairs).
-   Constraint propagation narrows domains (e.g., $X \in [1,6]$).
-   The search phase splits domains when propagation reaches fixpoint.

This is exactly the architecture described in §4.2, instantiated with FD constraints.


<a id="org3285b76"></a>

## 5.4 Narrowing as Symbolic Model Checking

Maude uses narrowing for *symbolic reachability analysis*: given a rewrite theory $R$ and an initial pattern $t$ with variables, narrowing computes all terms reachable from any instance of $t$. This is symbolic model checking&#x2014; the state space is explored symbolically rather than enumeratively.

This connects directly to our "Propagators as Model Checkers" research: the propagator network's fixpoint computation IS narrowing IS model checking. Adding explicit narrowing to Prologos would make the model checking capability more explicit and more powerful:

-   *Safety properties* (AG $\phi$): checked by propagation to fixpoint (already implemented).
-   *Reachability* (EF $\phi$): checked by narrowing from a pattern with variables (new).
-   *Bounded liveness* (AF $\phi$): checked by fuel-indexed narrowing (new).


<a id="orgb88d723"></a>

## 5.5 Global Constraints

Modern constraint solvers achieve practical performance through *global constraints*&#x2014;specialized propagators that exploit problem structure:

| Constraint               | Propagation                                            | Application             |
|------------------------ |------------------------------------------------------ |----------------------- |
| `all-different(Xs)`      | Bound consistency (Puget 1998) / matching (Regin 1994) | Scheduling, assignment  |
| `cumulative(Tasks, Cap)` | Timetable, energetic reasoning                         | Resource scheduling     |
| `table(Xs, Tuples)`      | GAC via bit-set intersection                           | Extensional constraints |
| `element(I, List, V)`    | AC on index→value                                      | Array access            |
| `circuit(Xs)`            | SCC-based filtering                                    | TSP, routing            |

These compile to specialized propagators that achieve stronger consistency than decomposition into binary constraints. In Prologos, each global constraint would be a propagator factory: given the constraint parameters, it creates a propagator with the appropriate cell dependencies and narrowing behavior.


<a id="orgeb104cd"></a>

## 5.6 Optimization and Branch-and-Bound

For optimization problems (`minimize`, `maximize`), the search strategy changes fundamentally: instead of finding all solutions, we maintain a *best-so-far* bound and prune branches that can't improve on it.

In the propagator architecture:

1.  Maintain a `cost-bound` cell (initially $+\infty$).
2.  When a solution is found with cost $c$: write $c$ to `cost-bound` (monotone decrease).
3.  Propagators watching `cost-bound` narrow the cost variable's domain to $[lo, c-1]$, which may trigger further domain narrowing.
4.  If the cost variable's domain becomes empty: prune this branch.

The propagator network makes branch-and-bound natural: the cost bound IS a lattice cell, and cost-pruning IS just another propagator.


<a id="orgeda2994"></a>

# 6. Research Connections


<a id="orgd8723b6"></a>

## 6.1 Narrowing and the Propagator Network

The deep connection: a propagator network running to quiescence IS narrowing.

-   Each cell represents partial knowledge about a variable.
-   Each propagator is a rewrite rule that fires when its inputs have sufficient information.
-   `run-to-quiescence` computes the narrowing derivation to normal form.
-   `atms-amb` introduces choice points when narrowing is non-deterministic.

The difference from Curry's implementation (PAKCS compiles to Prolog, KiCS2 compiles to Haskell) is that Prologos's narrowing would be *parallel and incremental* by construction&#x2014;propagators can fire in any order (BSP parallel scheduler), and adding new constraints only re-evaluates affected propagators.


<a id="orgefc968d"></a>

## 6.2 Connection to Abstract Interpretation

The widening/narrowing operators in `propagator.rkt` implement a two-phase iteration from abstract interpretation:

1.  **Widening phase**: over-approximate to force convergence (ascending Kleene chain with widening at limit points).
2.  **Narrowing phase**: recover precision by descending from the widened fixpoint.

This is the *lattice-theoretic* sense of narrowing, distinct from both FL narrowing and constraint narrowing, but all three share the same algebraic structure: monotone refinement on a lattice toward a fixpoint.
